#for 범위(시작, 끝+1, 증가값)

print("파이썬이 for문을 ~~~~\n" * 3)

for i in range(5):
    print("%d 파이썬이 for문을 ~~~~" % i)

print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")

for i in range(1, 6, 1): #(0, 5, 1)
    print("%d 파이썬 두번째 for문" % i)

print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")

for i in [0,1,2,3,4]:
    print("%d 파이썬" % i)

print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")

for i in range(1, 11, 2):
    print(i)

print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")

for i in range(1, 11, 1):
    print(i , end=' ')